src/toir_cf/src/InformationRegisters/торо_ВводНаОсновании/торо_ВводНаОсновании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВводНаОсновании</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВводимый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/CommonModules/торо_ЗаполнениеДокументовПовторноеИспользование/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает таблицу ввода на основании из регистра, со строками, где ввод разрешен.
//
// Возвращаемое значение:
//		ТаблицаЗначений - таблица значений с колонками ДокументОснование, ДокументВводимый.
Функция ПолучитьТаблицуВводаНаОсновании() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ВводНаОсновании.ДокументОснование,
	               |	торо_ВводНаОсновании.ДокументВводимый
	               |ИЗ
	               |	РегистрСведений.торо_ВводНаОсновании КАК торо_ВводНаОсновании
	               |ГДЕ
	               |	торо_ВводНаОсновании.Значение";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

#КонецОбласти
